---
kind: property
id: P:Autodesk.Revit.DB.FabricationVersionInfo.Reason
source: html/f428d1e8-09e0-4d4e-0832-f1459c762a6e.htm
---
# Autodesk.Revit.DB.FabricationVersionInfo.Reason Property

The user-specified reason for the change.

## Syntax (C#)
```csharp
public string Reason { get; }
```